#pragma once
/**
 * @copyright Copyright 2024, Jefferson Science Associates, LLC.
 *            Subject to the terms in the LICENSE file found in the
 *            top-level directory.
 *
 * @author    Bryan Moffit
 *            moffit@jlab.org                   Jefferson Lab, MS-12B3
 *            Phone: (757) 269-5660             12000 Jefferson Ave.
 *                                              Newport News, VA 23606
 *
 * @author    David Abbott
 *            abbottd@jlab.org                  Jefferson Lab, MS-12B3
 *            Phone: (757) 269-7190             12000 Jefferson Ave.
 *                                              Newport News, VA 23606
 * @file      faV3Lib.h
 *
 * @brief     Header for JLAB 250MHz FLASH ADC V3 library
 *
 */


#include <stdint.h>

#define FAV3_BOARD_ID       0xadc30000
#define FAV3_MAX_BOARDS             20
#define FAV3_MAX_ADC_CHANNELS       16
#define FAV3_MAX_DATA_PER_CHANNEL  251
#define FAV3_MAX_A32_MEM      0x800000	/* 8 Meg */
#define FAV3_MAX_A32MB_SIZE   0x800000	/*  8 MB */
#define FAV3_VME_INT_LEVEL           3
#define FAV3_VME_INT_VEC          0xFA

#define FAV3_SUPPORTED_CTRL_FIRMWARE 0x0E
#define FAV3_SUPPORTED_CTRL_FIRMWARE_NUMBER 1
#define FAV3_SUPPORTED_PROC_FIRMWARE 0xE00
#define FAV3_SUPPORTED_PROC_FIRMWARE_NUMBER 1

/* Macros to help with register spacers */
#define MERGE_(a,b)  a##b
#define LABEL_(a) MERGE_(uint32_t faV3blank, a)
#define BLANK LABEL_(__LINE__)

typedef struct
{
  /* 0x0100 */ volatile uint32_t status0;
  /* 0x0104 */ volatile uint32_t status1;
  /* 0x0108 */ volatile uint32_t status2;
  /* 0x010C */ volatile uint32_t config1;
  /* 0x0110 */ volatile uint32_t config2;
  /* 0x0114 */ volatile uint32_t config4;
  /* 0x0118 */ volatile uint32_t config5;
  /* 0x011C */ volatile uint32_t ptw;
  /* 0x0120 */ volatile uint32_t pl;
  /* 0x0124 */ volatile uint32_t nsb;
  /* 0x0128 */ volatile uint32_t nsa;
  /* 0x012C */ volatile uint32_t thres[8];
  /* 0x014C */ volatile uint32_t ptw_last_adr;
  /* 0x0150 */ volatile uint32_t ptw_max_buf;
  /* 0x0154 */ volatile uint32_t test_wave;
  /* 0x0158 */ volatile uint32_t pedestal[16];
  /* 0x0198 */ volatile uint32_t config3;
  /* 0x019C */ volatile uint32_t status3;
} faV3_adc_t;

typedef struct
{
  /* 0x0200 */ volatile uint32_t status;
  /* 0x0204 */ volatile uint32_t cfg;
  /* 0x0208 */ volatile uint32_t hit_width;
  /* 0x020C */ volatile uint32_t trig_delay;
  /* 0x0210 */ volatile uint32_t trig_width;
  /* 0x0214 */ volatile uint32_t window_bits;
  /* 0x0218 */ volatile uint32_t window_width;
  /* 0x021C */ volatile uint32_t coin_bits;
  /* 0x0220 */ volatile uint32_t pattern;
  /* 0x0224 */ volatile uint32_t fifo;
  /* 0x0228 */ volatile uint32_t sum_thresh;
} faV3_hitsum_t;

typedef struct
{
  /* 0x0300 */ volatile uint32_t scaler[16];
  /* 0x0340 */ volatile uint32_t time_count;
} faV3_scalers_t;

typedef struct
{
  /* 0x0400 */ volatile uint32_t testbit;
  /* 0x0404 */ volatile uint32_t count_250;
  /* 0x0408 */ volatile uint32_t count_sync;
  /* 0x040C */ volatile uint32_t count_trig1;
  /* 0x0410 */ volatile uint32_t count_trig2;
} faV3_system_test_t;

typedef struct
{
  /* 0x0500 */ volatile uint32_t state_level;
  /* 0x0504 */ volatile uint32_t state_csr;
  /* 0x0508 */ volatile uint32_t state_value;
  /* 0x050C */ BLANK[1];
  /* 0x0510 */ volatile uint32_t berr_driven_count;
  /* 0x0514 */ volatile uint32_t retry_driven_count;
  /* 0x0518 */ BLANK[1];
  /* 0x051C */ volatile uint32_t vxs_output_status;
  /* 0x0520 */ volatile uint32_t sparsify_control;
  /* 0x0524 */ volatile uint32_t sparsify_status;
  /* 0x0528 */ volatile uint32_t first_trigger_mismatch;
  /* 0x052C */ volatile uint32_t trigger_mismatch_counter;
  /* 0x0530 */ volatile uint32_t triggers_processed;
} faV3_aux_t;

typedef struct
{
  /* 0x0000 */ volatile uint32_t version;
  /* 0x0004 */ volatile uint32_t csr;
  /* 0x0008 */ volatile uint32_t ctrl1;
  /* 0x000C */ volatile uint32_t ctrl2;
  /* 0x0010 */ volatile uint32_t blocklevel;
  /* 0x0014 */ volatile uint32_t intr;
  /* 0x0018 */ volatile uint32_t adr32;
  /* 0x001C */ volatile uint32_t adr_mb;
  /* 0x0020 */ volatile uint32_t sec_adr;
  /* 0x0024 */ BLANK[1];
  /* 0x0028 */ volatile uint32_t trig_cfg;
  /* 0x002C */ volatile uint32_t reset;
  /* 0x0030 */ volatile uint32_t trig_count;
  /* 0x0034 */ volatile uint32_t ev_count;
  /* 0x0038 */ volatile uint32_t blk_count;
  /* 0x003C */ volatile uint32_t blk_fifo_count;
  /* 0x0040 */ volatile uint32_t blk_wrd_count;
  /* 0x0044 */ volatile uint32_t trig_live_count;
  /* 0x0048 */ volatile uint32_t ram_word_count;
  /* 0x004C */ volatile uint32_t flow_status;
  /* 0x0050 */ volatile uint32_t dac_csr;
  /* 0x0054 */ volatile uint32_t dac_data;
  /* 0x0058 */ BLANK[(0x70 - 0x58) >> 2];
  /* 0x0070 */ volatile uint32_t status1;
  /* 0x0074 */ volatile uint32_t status2;
  /* 0x0078 */ volatile uint32_t status3;
  /* 0x007C */ BLANK[(0x84 - 0x7C) >> 2];
  /* 0x0084 */ volatile uint32_t trigger_control;
  /* 0x0088 */ volatile uint32_t trig21_del;
  /* 0x008C */ volatile uint32_t mem_adr;
  /* 0x0090 */ volatile uint32_t mem1_data;
  /* 0x0094 */ volatile uint32_t mem2_data;
  /* 0x0098 */ volatile uint32_t prom_reg1;
  /* 0x009C */ volatile uint32_t prom_reg2;
  /* 0x00A0 */ volatile uint32_t berr_count;
  /* 0x00A4 */ volatile uint32_t berr_in_count;
  /* 0x00A8 */ volatile uint32_t proc_words_scal;
  /* 0x00AC */ volatile uint32_t lost_trig_scal;
  /* 0x00B0 */ volatile uint32_t header_scal;
  /* 0x00B4 */ volatile uint32_t trig2_scal;
  /* 0x00B8 */ volatile uint32_t trailer_scal;
  /* 0x00BC */ volatile uint32_t syncreset_scal;
  /* 0x00C0 */ volatile uint32_t busy_level;
  /* 0x00C4 */ volatile uint32_t gen_evt_header;
  /* 0x00C8 */ volatile uint32_t gen_evt_data;
  /* 0x00CC */ volatile uint32_t gen_evt_trail;
  /* 0x00D0 */ volatile uint32_t status_mgt;
  /* 0x00D4 */ volatile uint32_t ctrl_mgt;
  /* 0x00D8 */ volatile uint32_t mem_adr_w;
  /* 0x00DC */ volatile uint32_t mem_adr_r;
  /* 0x00E0 */ volatile uint32_t scaler_ctrl;
  /* 0x00E4 */ volatile uint32_t serial_reg[3];
  /* 0x00F0 */ volatile uint32_t scaler_insert;
  /* 0x00F4 */ volatile uint32_t sum_threshold;
  /* 0x00F8 */ volatile uint32_t sum_data;
  /* 0x00FC */ volatile uint32_t sys_mon;

  /* 0x0100 */ volatile faV3_adc_t adc;
  /* 0x01A0 */ BLANK[(0x200 - 0x1A0) >> 2];

  /* 0x0200 */ volatile faV3_hitsum_t hitsum;
  /* 0x022C */ BLANK[(0x300 - 0x22C) >> 2];

  /* 0x0300 */ volatile faV3_scalers_t scalers;
  /* 0x0344 */ BLANK[(0x400 - 0x344) >> 2];

  /* 0x0400 */ volatile faV3_system_test_t system_test;
  /* 0x0414 */ BLANK[(0x500 - 0x414) >> 2];

  /* 0x0500 */ volatile faV3_aux_t aux;
} faV3_t;

typedef struct faV3_data_struct
{
  uint32_t new_type;
  uint32_t type;
  uint32_t slot_id_hd;
  uint32_t slot_id_tr;
  uint32_t n_evts;
  uint32_t blk_num;
  uint32_t n_words;
  uint32_t evt_num_1;
  uint32_t trig_time;
  uint32_t time_now;
  uint32_t time_1;
  uint32_t time_2;
  uint32_t chan;
  uint32_t width;
  uint32_t valid_1;
  uint32_t adc_1;
  uint32_t valid_2;
  uint32_t adc_2;
  uint32_t over;
  uint32_t adc_sum;
  uint32_t pulse_num;
  uint32_t thres_bin;
  uint32_t quality;
  uint32_t evt_in_blk;
  uint32_t ped_q;
  uint32_t ped_sum;
  uint32_t integral;
  uint32_t integral_q;
  uint32_t above_thres;
  uint32_t time;
  uint32_t time_q;
  uint32_t chan_a;
  uint32_t source_a;
  uint32_t chan_b;
  uint32_t source_b;
  uint32_t group;
  uint32_t time_coarse;
  uint32_t time_fine;
  uint32_t vmin;
  uint32_t vpeak;
  uint32_t adc_latency;
  uint32_t adc_nsb;
  uint32_t adc_nsa;
  uint32_t scaler[18];
} faV3data_t;


