#pragma once
/******************************************************************************
 *
 *  fadcLib.h  - Driver library header file for readout of the JLAB 250MHz FLASH
 *                ADC using a VxWorks 5.5 or later based single board
 *                computer.
 *
 *  Author: David Abbott
 *          Jefferson Lab Data Acquisition Group
 *          June 2007
 *
 *  Revision  1.0 - Initial Revision
 *                    - Supports up to 20 FADC boards in a Crate
 *                    - Programmed I/O and Block reads
 *
 *  Revision  1.1 - Updated for new firmware (0x0111 or later)
 *                  Supports FADC Signal Distribution Module
 *
 *  Revision  1.2 - Updated to support Internal (HITSUM) triggering
 *                  and Moller firmware revisions of the FADC
 *
 *  Revision  2.0 - Updated to support FADC V2.
 *
 */


#include <stdint.h>

#define CLAS12

#define FAV3_BOARD_ID       0xfadc0000
#define FAV3_MAX_BOARDS             20
#define FAV3_MAX_ADC_CHANNELS       16
#define FAV3_MAX_DATA_PER_CHANNEL  251
#define FAV3_MAX_A32_MEM      0x800000	/* 8 Meg */
#define FAV3_MAX_A32MB_SIZE   0x800000	/*  8 MB */
#define FAV3_VME_INT_LEVEL           3
#define FAV3_VME_INT_VEC          0xFA

#define FAV3_SUPPORTED_CTRL_FIRMWARE 0xBB
#define FAV3_SUPPORTED_CTRL_FIRMWARE_NUMBER 1
#define FAV3_SUPPORTED_PROC_FIRMWARE 0x1B07
#define FAV3_SUPPORTED_PROC_FIRMWARE_NUMBER 1


typedef struct faV3_struct
{
  /* 0x0000 */ volatile uint32_t version;
  /* 0x0004 */ volatile uint32_t csr;
  /* 0x0008 */ volatile uint32_t ctrl1;
  /* 0x000C */ volatile uint32_t ctrl2;
  /* 0x0010 */ volatile uint32_t blk_level;
  /* 0x0014 */ volatile uint32_t intr;
  /* 0x0018 */ volatile uint32_t adr32;
  /* 0x001C */ volatile uint32_t adr_mb;
  /* 0x0020 */ volatile uint32_t s_adr;
  /* 0x0024 */ volatile uint32_t delay;
  /* 0x0028 */ volatile uint32_t itrig_cfg;
  /* 0x002C */ volatile uint32_t reset;
  /* 0x0030 */ volatile uint32_t trig_scal;
  /* 0x0034 */ volatile uint32_t ev_count;
  /* 0x0038 */ volatile uint32_t blk_count;
  /* 0x003C */ volatile uint32_t blk_fifo_count;
  /* 0x0040 */ volatile uint32_t blk_wrdcnt_fifo;
  /* 0x0044 */ volatile uint32_t internal_trig_scal;
  /* 0x0048 */ volatile uint32_t ram_word_count;
  /* 0x004C */ volatile uint32_t dataflow_status;
  /* 0x0050 */ volatile uint16_t dac[16];
  /* 0x0070 */ volatile uint32_t status[4];
  /* 0x0080 */ volatile uint32_t aux;
  /* 0x0084 */ volatile uint32_t trigger_control;
  /* 0x0088 */ volatile uint32_t trig21_delay;
  /* 0x008C */ volatile uint32_t mem_adr;
  /* 0x0090 */ volatile uint32_t mem1_data;
  /* 0x0094 */ volatile uint32_t mem2_data;
  /* 0x0098 */ volatile uint32_t prom_reg1;
  /* 0x009C */ volatile uint32_t prom_reg2;
  /* 0x00A0 */ volatile uint32_t berr_module_scal;
  /* 0x00A4 */ volatile uint32_t berr_crate_scal;
  /* 0x00A8 */ volatile uint32_t proc_words_scal;
  /* 0x00AC */ volatile uint32_t aux_scal2;
  /* 0x00B0 */ volatile uint32_t header_scal;
  /* 0x00B4 */ volatile uint32_t trig2_scal;
  /* 0x00B8 */ volatile uint32_t trailer_scal;
  /* 0x00BC */ volatile uint32_t syncreset_scal;
  /* 0x00C0 */ volatile uint32_t busy_level;
  /* 0x00C4 */ volatile uint32_t gen_evt_header;
  /* 0x00C8 */ volatile uint32_t gen_evt_data;
  /* 0x00CC */ volatile uint32_t gen_evt_trailer;
  /* 0x00D0 */ volatile uint32_t mgt_status;
  /* 0x00D4 */ volatile uint32_t mgt_ctrl;
  /* 0x00D8 */ volatile uint32_t reserved_ctrl[2];
  /* 0x00E0 */ volatile uint32_t scaler_ctrl;
  /* 0x00E4 */ volatile uint32_t serial_number[3];
  /* 0x00F0 */ volatile uint32_t scaler_interval;
  /* 0x00F4 */ volatile uint32_t spare_ctrl[(0xFC - 0xF4) >> 2];
  /* 0x00FC */ volatile uint32_t system_monitor;

  /* 0x0100 */ volatile uint32_t adc_status[3];
  /* 0x010C */ volatile uint32_t adc_config[4];
  /* 0x011C */ volatile uint32_t adc_ptw;
  /* 0x0120 */ volatile uint32_t adc_pl;
  /* 0x0124 */ volatile uint32_t adc_nsb;
  /* 0x0128 */ volatile uint32_t adc_nsa;
  /* 0x012C */ volatile uint16_t adc_thres[16];
  /* 0x014C */ volatile uint32_t ptw_last_adr;
  /* 0x0150 */ volatile uint32_t ptw_max_buf;
  /* 0x0154 */ volatile uint32_t adc_test_data;

#ifdef CLAS12
  /* 0x0158 */ volatile uint16_t adc_pedestal[16];
  /* 0x0178 */ volatile uint16_t adc_delay[16];
  /* 0x0198 */ volatile uint32_t adc_gain[16];
  /* 0x01d8 */ volatile uint32_t hitbit_trig_mask;
  /* 0x01dc */ volatile uint32_t hitbit_trig_width;
  /* 0x01e0 */ volatile uint32_t hitbit_cfg;
  /* 0x01e4 */ volatile uint32_t spare_adc[(0x200 - 0x1e4) >> 2];

  /* 0x0200 */ volatile uint16_t la_ctrl;
  /* 0x0202 */ volatile uint16_t la_status;
  /* 0x0204 */ volatile uint16_t adc_scaler_ctrl;
  /* 0x0206 */ volatile uint16_t spare_adc0[(0x220 - 0x206) >> 1];
  /* 0x0220 */ volatile uint16_t la_cmp_mode0[16];
  /* 0x0240 */ volatile uint16_t la_cmp_thr0[16];
  /* 0x0260 */ volatile uint16_t adc_accumulator0[16];
  /* 0x0280 */ volatile uint16_t adc_accumulator1[16];
  /* 0x02A0 */ volatile uint16_t adc_accumulator2[16];
  /* 0x02C0 */ volatile uint16_t la_data[13];
  /* 0x02DA */ volatile uint16_t spare_adc1[(0x300 - 0x2DA) >> 1];
#else
  /* 0x0158 */ volatile uint32_t adc_pedestal[16];
  /* 0x0198 */ volatile uint32_t spare_adc[(0x200 - 0x198) >> 2];

  /* 0x0200 */ volatile uint32_t hitsum_status;
  /* 0x0204 */ volatile uint32_t hitsum_cfg;
  /* 0x0208 */ volatile uint32_t hitsum_hit_width;
  /* 0x020C */ volatile uint32_t hitsum_trig_delay;
  /* 0x0210 */ volatile uint32_t hitsum_trig_width;
  /* 0x0214 */ volatile uint32_t hitsum_window_bits;
  /* 0x0218 */ volatile uint32_t hitsum_window_width;
  /* 0x021C */ volatile uint32_t hitsum_coin_bits;
  /* 0x0220 */ volatile uint32_t hitsum_pattern;
  /* 0x0224 */ volatile uint32_t hitsum_fifo;
  /* 0x0228 */ volatile uint32_t hitsum_sum_thresh;
  /* 0x022C */ volatile uint32_t spare_hitsum[(0x300 - 0x22C) >> 2];
#endif


  /* 0x0300 */ volatile uint32_t scaler[16];
  /* 0x0340 */ volatile uint32_t time_count;
  /* 0x0344 */ volatile uint32_t spare_scaler[(0x400 - 0x344) >> 2];

  /* 0x0400 */ volatile uint32_t testBit;
  /* 0x0404 */ volatile uint32_t clock250count;
  /* 0x0408 */ volatile uint32_t syncp0count;
  /* 0x040C */ volatile uint32_t trig1p0count;
  /* 0x0410 */ volatile uint32_t trig2p0count;

#ifdef CLAS12
  /* 0x0414 */ volatile uint32_t spare_adc_1[(0x500 - 0x414) >> 2];
  /* 0x0500 */ volatile uint32_t gtx_ctrl;
  /* 0x0504 */ volatile uint32_t /*spare_gtx1 */ state_csr;	/* for Ed */
  /* 0x0508 */ volatile uint32_t /*trx_ctrl */ state_value;	/* for Ed */
  /* 0x050C */ volatile uint32_t spare_gtx3;
  /* 0x0510 */ volatile uint32_t gtx_status;
  /* 0x0514 */ volatile uint32_t spare_gtx4;
  /* 0x0518 */ volatile uint32_t gtx_la_ctrl;
  /* 0x051C */ volatile uint32_t gtx_la_status;

  /* 0x0520 */ volatile uint32_t sparse_control;
  /* 0x0524 */ volatile uint32_t sparse_status;
  /* 0x0528 */ volatile uint32_t first_trigger_mismatch;
  /* 0x052C */ volatile uint32_t trigger_mismatch_counter;
  /* 0x0530 */ volatile uint32_t triggers_processed;
  /* 0x0534 */ volatile uint32_t spare;

  /* 0x0538 */ volatile uint32_t gtx_la_val[2];
  /* 0x0540 */ volatile uint32_t spare_gtx[(0x580 - 0x540) >> 2];
  /* 0x0580 */ volatile uint32_t hist_ctrl;
  /* 0x0584 */ volatile uint32_t hist_time;
  /* 0x0588 */ volatile uint32_t hist_data[16];
#endif

} faV3_t;

typedef struct faV3_data_struct
{
  uint32_t new_type;
  uint32_t type;
  uint32_t slot_id_hd;
  uint32_t slot_id_tr;
  uint32_t n_evts;
  uint32_t blk_num;
  uint32_t n_words;
  uint32_t evt_num_1;
  uint32_t evt_num_2;
  uint32_t time_now;
  uint32_t time_1;
  uint32_t time_2;
  uint32_t time_3;
  uint32_t time_4;
  uint32_t chan;
  uint32_t width;
  uint32_t valid_1;
  uint32_t adc_1;
  uint32_t valid_2;
  uint32_t adc_2;
  uint32_t over;
  uint32_t adc_sum;
  uint32_t pulse_num;
  uint32_t thres_bin;
  uint32_t quality;
  uint32_t integral;
  uint32_t time;
  uint32_t chan_a;
  uint32_t source_a;
  uint32_t chan_b;
  uint32_t source_b;
  uint32_t group;
  uint32_t time_coarse;
  uint32_t time_fine;
  uint32_t vmin;
  uint32_t vpeak;
  uint32_t trig_type_int;	/* next 4 for internal trigger data */
  uint32_t trig_state_int;	/* e.g. helicity */
  uint32_t evt_num_int;
  uint32_t err_status_int;
} faV3data_t;


